In [171]:
import numpy as np
import pandas as pd

In [172]:
data_one = {'A': ['A0','A1', 'A3'], 'B': ['B1', 'B2', 'B3']}
data_two = {'C': ['C0','C1', 'C3'], 'D': ['1D', '2D', '3D']}

In [173]:
one = pd.DataFrame(data_one)
two = pd.DataFrame(data_two)

In [174]:
one

    A   B
0  A0  B1
1  A1  B2
2  A3  B3

In [175]:
two

    C   D
0  C0  1D
1  C1  2D
2  C3  3D

In [176]:
pd.concat([one,two],axis=1)

    A   B   C   D
0  A0  B1  C0  1D
1  A1  B2  C1  2D
2  A3  B3  C3  3D

In [177]:
two.columns = one.columns

In [178]:
two

    A   B
0  C0  1D
1  C1  2D
2  C3  3D

In [179]:
mydf = pd.concat([one,two])

In [180]:
mydf

    A   B
0  A0  B1
1  A1  B2
2  A3  B3
0  C0  1D
1  C1  2D
2  C3  3D

In [181]:
mydf.index = range(len(mydf))

In [182]:
mydf

    A   B
0  A0  B1
1  A1  B2
2  A3  B3
3  C0  1D
4  C1  2D
5  C3  3D

In [183]:
reg = pd.DataFrame({'reg_id': [1,2,4], 'name': ['hisham', 'ihsdfd', 'ihsam']})

In [184]:
log = pd.DataFrame({'log_id': [1,43,3], 'name': ['hisham', 'sdfsdf', 'ihsam']})

In [185]:
log

   log_id    name
0       1  hisham
1      43  sdfsdf
2       3   ihsam

In [186]:
reg

   reg_id    name
0       1  hisham
1       2  ihsdfd
2       4   ihsam

In [187]:
pd.merge(reg,log, how='inner',on='name')

   reg_id    name  log_id
0       1  hisham       1
1       4   ihsam       3

In [188]:
pd.merge(log,reg,how='right',on="name")

   log_id    name  reg_id
0     1.0  hisham       1
1     NaN  ihsdfd       2
2     3.0   ihsam       4

In [189]:
df = pd.merge(log,reg,how='left',on="name")

In [190]:
df

   log_id    name  reg_id
0       1  hisham     1.0
1      43  sdfsdf     NaN
2       3   ihsam     4.0

In [191]:
df[df['reg_id'].isnull()]

   log_id    name  reg_id
1      43  sdfsdf     NaN

In [192]:
df['reg_id']

0    1.0
1    NaN
2    4.0
Name: reg_id, dtype: float64

In [195]:
df['reg_id'] = df['reg_id'].fillna('/')

In [196]:
df

   log_id    name reg_id
0       1  hisham    1.0
1      43  sdfsdf      /
2       3   ihsam    4.0

In [198]:
df = pd.merge(reg,log,how="outer", on="name")

In [204]:
df.dropna(subset=['log_id'])

   reg_id    name  log_id
0     1.0  hisham     1.0
2     4.0   ihsam     3.0
3     NaN  sdfsdf    43.0